import pandas as pd
import csv

 # 5.2일 알고리즘 시험 완료..시범운용가능상태..
 # 해야할 것들: 홍추가, 메뉴추가, 외자들 딕셔너리에 다양하게 추가(like 향), 가능한 맨트들 추가.
 # 버전 업그레이드를 위한 생각: 문자열안에 포맷문자 생각해보기,,대화 하나하나를 읽는 알고리즘 생각해보기,,엄마 아빠 매칭(2세한테.),,어르신 = 신종훈 목사님 = 대표님, 위상무 = 위세량 오봉 = 오봉엽, 산양 = 선영, 
 

with open("C:/Users/오세현/Desktop/버전1시험 최종 카톡내용.txt", "r", encoding="UTF-8") as f:
    
    # 딕셔너리로 이름과 항목별 돈을 정리.
    dic1 = {"세현": [0, 0, 0, 0], "오쭈": [0, 0, 0, 0], "유빈": [0, 0, 0, 0], "싸리" : [0, 0, 0, 0], "하루" : [0, 0, 0, 0],
            "하루나" : [0, 0, 0, 0], "박혜" : [0, 0, 0, 0], "주혜" : [0, 0, 0, 0], "장미" : [0, 0, 0, 0], "김미" : [0, 0, 0, 0],
            "이쭈" : [0, 0, 0, 0], "단디" : [0, 0, 0, 0], "데이빗" : [0, 0, 0, 0], "까루나" : [0, 0, 0, 0], "재순" : [0, 0, 0, 0]
            , "규온": [0, 0, 0, 0], "김호": [0, 0, 0, 0], "정설":[0, 0, 0, 0], "윤미": [0, 0, 0, 0], "세량": [0, 0, 0, 0],
            "데코팀" : [0, 0, 0, 0], "농사팀" : [0, 0, 0, 0], "서인":[0, 0 ,0 ,0], "영경":[0, 0, 0, 0], "목사님":[0, 0, 0, 0], "대표님":[0, 0, 0, 0],
            "김향" : [0, 0, 0, 0], "향" : [0, 0, 0, 0], "향이" : [0, 0, 0, 0], "향누" : [0, 0, 0, 0], "향언" : [0, 0, 0, 0], "향," : [0, 0, 0, 0]
            }
                      # 먹 주 받 총
    
    dic2 = {"한": 1, "1":1, "두":2, "2":2, "세":3, "3":3, "네":4, "4":4, "다섯":5, "5":5, "여섯":6, "6":6, "일곱":7, "7":7}
    
    
    def ta_and_re(num):
        dic1[ta][1] = dic1[ta][1] - (cup*3000)
        dic1[ta][3] = dic1[ta][3] - (cup*3000)
        if (re == "하루") and (i[len(i)-num][2] == "나"):
            dic1["하루나"][2] = dic1["하루나"][2] + (cup*3000)
            dic1["하루나"][3] = dic1["하루나"][3] + (cup*3000)
        elif re == "까루":
            dic1["까루나"][2] = dic1["까루나"][2] + (3000*cup)
            dic1["까루나"][3] = dic1["까루나"][3] + (3000*cup)
        elif re == "데이":
            dic1["데이빗"][2] = dic1["데이빗"][2] + (3000*cup)
            dic1["데이빗"][3] = dic1["데이빗"][3] + (3000*cup)
        else:
            dic1[re][2] = dic1[re][2] + (cup*3000)
            dic1[re][3] = dic1[re][3] + (cup*3000)
                    
                    
    # 본격적으로 파일을 읽고 처리하는 부분시작.  ta는 선물주는 사람, re는 선물받는 사람 cup은 잔 수
    for i in f:
        i = i.split()
        count = 2
        # 1번 알고리즘(선물하는 경우)
        if ("선물합니다." in i) or ("선물부탁드립니다." in i):
            if "섬김이분들께" in i:
                kind = i[(len(i)-5)]
                lst = input(f"{kind} 섬김이들 이름을 입력하시오:") 
                lst = lst.split(" ")
                ta = i[0][2:4]
                cup = dic2[i[(len(i)-2)][0]]
                if ta == "이빗":
                    ta = "데이빗"
                elif ta == "루나":
                    ta = "하루나"
                elif ta == "경현":
                    ta = "까루나"
                elif ta == "향]":
                    ta = "김향"
                elif ta == "호]":
                    ta = "김호"
                elif ta == "설]":
                    ta = "정설"
                elif ta == "이]":
                    ta = "하이"
                elif ta == "미애":
                    if i[0][1] == "장":
                        ta = "장미"
                    elif i[0][1] == "김":
                        ta = "김미"         
                elif ta == "주현":
                    if i[0][1] == "이":
                        ta = "이쭈"
                    elif i[0][1] == "오":
                        ta = "오쭈"
                dic1[ta][1] = dic1[ta][1] - (3000*cup*len(lst))
                dic1[ta][3] = dic1[ta][3] - (3000*cup*len(lst))
                for h in lst:
                    dic1[h][2] = dic1[h][2] + (3000*cup)
                    dic1[h][3] = dic1[h][3] + (3000*cup)
            else:
                re = i[len(i)-4][0:2]
                ta = i[0][2:4]
                if ta == "이빗":
                    ta = "데이빗"
                elif ta == "루나":
                    ta = "하루나"
                elif ta == "경현":
                    ta == "까루나"
                elif ta == "향]":
                    ta = "김향"
                elif ta == "호]":
                    ta = "김호"
                elif ta == "설]":
                    ta = "정설"
                elif ta == "이]":
                    ta = "하이"
                elif ta == "미애":
                    if i[0][1] == "장":
                        ta = "장미"
                    elif i[0][1] == "김":
                        ta = "김미"
                elif ta == "주현":
                    if i[0][1] == "오":
                        ta = "오쭈"
                    elif i[0][1] == "이":
                        ta = "이쭈"
                cup = dic2[i[len(i)-2][0]]
                re = i[len(i)-4][0:2]
                ta_and_re(4)
                if i[len(i)-5][0:2] in dic1.keys():
                    re = i[len(i)-5][0:2]
                    ta_and_re(5)
                    if i[len(i)-6][0:2] in dic1.keys():
                        re = i[len(i)-6][0:2]
                        ta_and_re(6)
                        if i[len(i)-7][0:2] in dic1.keys():
                            re = i[len(i)-7][0:2]
                            ta_and_re(7)
                            if i[len(i)-8][0:2] in dic1.keys():
                                re = i[len(i)-8][0:2]
                                ta_and_re(8)
                                if i[len(i)-9][0:2] in dic1.keys():
                                    re = i[len(i)-9][0:2]
                                    ta_and_re(9)
                                    if i[len(i)-10][0:2] in dic1.keys():
                                        re = i[len(i)-10][0:2]
                                        ta_and_re(10)
           
                        
                        
                    
   
        # 2번 알고리즘(주문하는 경우)
        elif ("부탁드립니다." in i) or ("먹었습니다." in i) or ("주문합니다." in i) or ("부탁합니다." in i) or ("신청합니다."in i) or ("부탁드려요^^"in i) or ("부탁드려요"in i):
            menu = i[(len(i)-3)]
            cup = dic2(i[(len(i)-2)][0])
            ta = i[0][2:4]
            # 별명으로 부르는 경우
            if ta == "루나":
                ta = "하루나"  
            elif ta == "경현":
                ta = "까루나"  
            elif ta == "이빗":
                ta = "데이빗"
            elif ta == "향]":
                ta = "김향"
            elif ta == "호]":
                ta = "김호"
            elif ta == "설]":
                ta = "정설"
            elif ta == "이]":
                ta = "하이"
            elif ta == "미애":
                if i[0][1] == "장":
                    ta = "장미"
                elif i[0][1] == "김":
                    ta = "김미"   
            elif ta == "주현":
                if i[0][1] == "이":
                    ta = "이쭈"
                elif i[0][1] == "오":
                    ta = "오쭈"
            if menu[0] == "베":
                dic1[ta][0] = dic1[ta][0] - (2500*cup)
                dic1[ta][3] = dic1[ta][3] - (2500*cup)
            '''
            메뉴 적기
            '''
        
        # 3번 알고리즘(주문하는 경우)
        elif i != []:
            if (i[len(i)-1]) in ["1", "2", "3", "4", "5", "6", "7"]:
                if i[3][0:2] in dic1.keys():
                    ta = i[3][0:2]
                    if (ta == "하루") and (i[3][2] == "나"):
                        ta = "하루나"
                    elif ta == "까루":
                        ta = "까루나"
                    elif ta == "데이":
                        ta == "데이빗"
                    l = 2
                    for m in range(0, (len(i)-5), 2):
                        l = l + 2
                        if i[l][0] == "베":
                            dic1[ta][0] = dic1[ta][0] - (2500*int(i[l+1][0]))
                            dic1[ta][3] = dic1[ta][3] - (2500*int(i[l+1][0]))
                            '''
                            메뉴적기
                            '''
               
                            
                # 본인이름으로 먹을떄(3-2)
                else:
                    ta = i[0][2:4]
                    if ta == "루나":
                        ta = "하루나"
                    elif ta == "이빗":
                        ta = "데이빗"
                    elif ta == "경현":
                        ta = "까루나"
                    elif ta == "향]":
                        ta = "김향"
                    elif ta == "호]":
                        ta = "김호"
                    elif ta == "설]":
                        ta = "정설"
                    elif ta == "이]":
                        ta = "하이"
                    l = 1
                    for m in range(0, (len(i)-3), 2):
                        l = l + 2
                        if i[l][0] == "베":
                            dic1[ta][0] = dic1[ta][0] - (2500*int(i[l+1][0]))
                            dic1[ta][3] = dic1[ta][3] - (2500*int(i[l+1][0]))
                            '''
                            메뉴적기
                            '''
                    
                    
                                
    # 별명 추가 방법.
    dic1["목사님"][0] = dic1["목사님"][0] + dic1["대표님"][0]
    dic1["목사님"][1] = dic1["목사님"][1] + dic1["대표님"][1]
    dic1["목사님"][2] = dic1["목사님"][2] + dic1["대표님"][2]
    dic1["목사님"][3] = dic1["목사님"][3] + dic1["대표님"][3]
    dic1["김향"][0] = dic1["김향"][0] + dic1["향"][0] + dic1["향,"][0] + dic1["향누"][0] + dic1["향언"][0] + dic1["향이"][0]
    dic1["김향"][1] = dic1["김향"][1] + dic1["향"][1] + dic1["향,"][1] + dic1["향누"][1] + dic1["향언"][1] + dic1["향이"][1]
    dic1["김향"][2] = dic1["김향"][2] + dic1["향"][2] + dic1["향,"][2] + dic1["향누"][2] + dic1["향언"][2] + dic1["향이"][2]
    dic1["김향"][3] = dic1["김향"][3] + dic1["향"][3] + dic1["향,"][3] + dic1["향누"][3] + dic1["향언"][3] + dic1["향이"][3]
    
    
    del dic1["대표님"], dic1["향이"], dic1["향언"], dic1["향누"], dic1["향,"], dic1["향"]
    # 나중에 다시 추가 해줘야 한다.

                       
                        
            
                
    # 행렬표를 만들기 위해, 딕셔너리형태에서 이차원리스트형태로.
    c = [["이름", "먹은", "선물한", "선물받은", "합산"]]
    d = []
    for name, money in dic1.items():
        d.append(name)
        d.extend(money)
        c.append(d)
        d = []
    
    
    # 표를 보여준다.
    df = pd.DataFrame(c, columns=["이름", "e", "g", "r", "s"]) # e{at)는 먹은금액, g(vie)는 준선물, r(ecieve)은 받은선물, s(sum)는 정산결과
    print(df)
    
     
with open("doo/공감.csv", "w", encoding="UTF-8") as f:
    writer = csv.writer(f)
    writer.writerows(c)
    
    dic1["대표님"] = [0, 0, 0, 0]
    dic1["향이"], dic1["향언"], dic1["향누"], dic1["향,"], dic1["향"] = [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]
    # 추가 !